betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_gpio.c
/* Definitions for bit manipulation of CFGLOW and CFGHIG register */
#define  GPIO_CFG_MODE_INPUT         0x00000000u /*!< 00: Input mode (reset state)  */
#define  GPIO_CFG_CFG_ANALOG         0x00000000u /*!< 00: Analog mode  */
#define  GPIO_CFG_CFG_INPUT_FLOATING 0x00000004u /*!< 01: Floating input (reset state)  */
#define  GPIO_CFG_CFG_INPUT_PU_PD    0x00000008u /*!< 10: Input with pull-up / pull-down  */
#define  GPIO_CFG_CFG_GP_OUTPUT_PP   0x00000000u /*!< 00: General purpose output push-pull  */
#define  GPIO_CFG_CFG_GP_OUTPUT_OD   0x00000004u /*!< 01: General purpose output Open-drain  */
#define  GPIO_CFG_CFG_AF_OUTPUT_PP   0x00000008u /*!< 10: Alternate function output Push-pull  */
#define  GPIO_CFG_CFG_AF_OUTPUT_OD   0x0000000Cu /*!< 11: Alternate function output Open-drain  */

/**
  * @}
  */
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/
/** @defgroup GPIO_Exported_Functions GPIO Exported Functions
  * @{
  */

/** @defgroup GPIO_Exported_Functions_Group1 Initialization and de-initialization functions
  *  @brief    Initialization and Configuration functions
  *
@verbatim    
 ===============================================================================
              ##### Initialization and de-initialization functions #####
 ===============================================================================
  [..]
    This section provides functions allowing to initialize and de-initialize the GPIOs
    to be ready for use.
 
@endverbatim
  * @{
  */


/**
  * @brief  Initializes the GPIOx peripheral according to the specified parameters in the GPIO_Init.
  * @param  GPIOx where x can be (A..I) to select the GPIO peripheral for APM32F40XX.
  * @param  GPIO_Init pointer to a GPIO_InitTypeDef structure that contains
  *         the configuration information for the specified GPIO peripheral.
  * @retval None
  */
void DAL_GPIO_Init(GPIO_TypeDef  *GPIOx, GPIO_InitTypeDef *GPIO_Init)
{
  uint32_t position;
  uint32_t ioposition = 0x00U;
  uint32_t iocurrent = 0x00U;
  uint32_t temp = 0x00U;
#if defined(APM32F403xx) || defined(APM32F402xx)
  __IO uint32_t *configregister; /* Store the address of CRL or CRH register based on pin number */
  uint32_t registeroffset;       /* offset used during computation of CNF and MODE bits placement inside CRL or CRH register */
#endif /* APM32F403xx || APM32F402xx */

  /* Check the parameters */
  ASSERT_PARAM(IS_GPIO_ALL_INSTANCE(GPIOx));
  ASSERT_PARAM(IS_GPIO_PIN(GPIO_Init->Pin));
  ASSERT_PARAM(IS_GPIO_MODE(GPIO_Init->Mode));

  /* Configure the port pins */
  for(position = 0U; position < GPIO_NUMBER; position++)
  {
    /* Get the IO position */
    ioposition = 0x01U << position;
    /* Get the current IO position */
    iocurrent = (uint32_t)(GPIO_Init->Pin) & ioposition;

    if(iocurrent == ioposition)
    {
      /*--------------------- GPIO Mode Configuration ------------------------*/
#if defined(APM32F403xx) || defined(APM32F402xx)
      /* Based on the required mode, filling config variable with MODEy[1:0] and CNFy[3:2] corresponding bits */
      switch (GPIO_Init->Mode)
      {
        case GPIO_MODE_OUTPUT_PP:
          /* Check the Speed parameter */
          ASSERT_PARAM(IS_GPIO_SPEED(GPIO_Init->Speed));
          temp = GPIO_Init->Speed + GPIO_CFG_CFG_GP_OUTPUT_PP;
          break;

        case GPIO_MODE_OUTPUT_OD:
          /* Check the Speed parameter */
          ASSERT_PARAM(IS_GPIO_SPEED(GPIO_Init->Speed));
          temp = GPIO_Init->Speed + GPIO_CFG_CFG_GP_OUTPUT_OD;
          break;

        case GPIO_MODE_AF_PP:
          /* Check the Speed parameter */
          ASSERT_PARAM(IS_GPIO_SPEED(GPIO_Init->Speed));
          temp = GPIO_Init->Speed + GPIO_CFG_CFG_AF_OUTPUT_PP;
          break;

        case GPIO_MODE_AF_OD:
          /* Check the Speed parameter */
          ASSERT_PARAM(IS_GPIO_SPEED(GPIO_Init->Speed));
          temp = GPIO_Init->Speed + GPIO_CFG_CFG_AF_OUTPUT_OD;
          break;

        case GPIO_MODE_ANALOG:
          temp = GPIO_CFG_MODE_INPUT + GPIO_CFG_CFG_ANALOG;
          break;

        case GPIO_MODE_INPUT:
        case GPIO_MODE_IT_RISING:
        case GPIO_MODE_IT_FALLING:
        case GPIO_MODE_IT_RISING_FALLING:
        case GPIO_MODE_EVT_RISING:
        case GPIO_MODE_EVT_FALLING:
        case GPIO_MODE_EVT_RISING_FALLING:
          /* Check the Pull parameter */
          ASSERT_PARAM(IS_GPIO_PULL(GPIO_Init->Pull));
          if (GPIO_Init->Pull == GPIO_NOPULL)
          {
            temp = GPIO_CFG_MODE_INPUT + GPIO_CFG_CFG_INPUT_FLOATING;
          }
          else if (GPIO_Init->Pull == GPIO_PULLUP)
          {
            temp = GPIO_CFG_MODE_INPUT + GPIO_CFG_CFG_INPUT_PU_PD;
            /* Set the corresponding ODATA bit */
            GPIOx->BSC = ioposition;
          }
          else /* GPIO_PULLDOWN */
          {
            temp = GPIO_CFG_MODE_INPUT + GPIO_CFG_CFG_INPUT_PU_PD;
            /* Reset the corresponding ODATA bit */
            GPIOx->BC = ioposition;
          }
          break;

        default:
          break;
      }

      /* Check if the current bit belongs to first half or last half of the pin count number
       in order to address CRH or CRL register*/
      configregister = (iocurrent < GPIO_PIN_8) ? &GPIOx->CFGLOW     : &GPIOx->CFGHIG;
      registeroffset = (iocurrent < GPIO_PIN_8) ? (position << 2u) : ((position - 8u) << 2u);

      /* Apply the new configuration of the pin to the register */
      MODIFY_REG((*configregister), ((GPIO_CFGLOW_MODE0 | GPIO_CFGLOW_CFG0) << registeroffset), (temp << registeroffset));
#else
      /* In case of Output or Alternate function mode selection */
      if(((GPIO_Init->Mode & GPIO_MODE) == MODE_OUTPUT) || \
          (GPIO_Init->Mode & GPIO_MODE) == MODE_AF)
      {
        /* Check the Speed parameter */
        ASSERT_PARAM(IS_GPIO_SPEED(GPIO_Init->Speed));
        /* Configure the IO Speed */
        temp = GPIOx->OSSEL; 
        temp &= ~(GPIO_OSPEEDER_OSPEEDR0 << (position * 2U));
        temp |= (GPIO_Init->Speed << (position * 2U));
        GPIOx->OSSEL = temp;

        /* Configure the IO Output Type */
        temp = GPIOx->OMODE;
        temp &= ~(GPIO_OMODE_OT_0 << position) ;
        temp |= (((GPIO_Init->Mode & OUTPUT_TYPE) >> OUTPUT_TYPE_Pos) << position);
        GPIOx->OMODE = temp;
       }

      if((GPIO_Init->Mode & GPIO_MODE) != MODE_ANALOG)
      {
        /* Check the parameters */
        ASSERT_PARAM(IS_GPIO_PULL(GPIO_Init->Pull));
        
        /* Activate the Pull-up or Pull down resistor for the current IO */
        temp = GPIOx->PUPD;
        temp &= ~(GPIO_PUPD_PUPDR0 << (position * 2U));
        temp |= ((GPIO_Init->Pull) << (position * 2U));
        GPIOx->PUPD = temp;
      }

