betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_gpio.c
      /* In case of Alternate function mode selection */
      if((GPIO_Init->Mode & GPIO_MODE) == MODE_AF)
      {
        /* Check the Alternate function parameter */
        ASSERT_PARAM(IS_GPIO_AF(GPIO_Init->Alternate));
        /* Configure Alternate function mapped with the current IO */
        temp = GPIOx->ALF[position >> 3U];
        temp &= ~(0xFU << ((uint32_t)(position & 0x07U) * 4U)) ;
        temp |= ((uint32_t)(GPIO_Init->Alternate) << (((uint32_t)position & 0x07U) * 4U));
        GPIOx->ALF[position >> 3U] = temp;
      }

      /* Configure IO Direction mode (Input, Output, Alternate or Analog) */
      temp = GPIOx->MODE;
      temp &= ~(GPIO_MODE_MODE0 << (position * 2U));
      temp |= ((GPIO_Init->Mode & GPIO_MODE) << (position * 2U));
      GPIOx->MODE = temp;
#endif /* APM32F403xx || APM32F402xx */

      /*--------------------- EINT Mode Configuration ------------------------*/
      /* Configure the External Interrupt or event for the current IO */
      if((GPIO_Init->Mode & EINT_MODE) != 0x00U)
      {
#if defined(APM32F403xx) || defined(APM32F402xx)
        /* Enable AFIO Clock */
        __DAL_RCM_AFIO_CLK_ENABLE();
        temp = AFIO->EINTSEL[position >> 2U];
        temp &= ~(0x0FU << (4U * (position & 0x03U)));
        temp |= ((uint32_t)(GPIO_GET_INDEX(GPIOx)) << (4U * (position & 0x03U)));
        AFIO->EINTSEL[position >> 2U] = temp;
#else
        /* Enable SYSCFG Clock */
        __DAL_RCM_SYSCFG_CLK_ENABLE();

        temp = SYSCFG->EINTCFG[position >> 2U];
        temp &= ~(0x0FU << (4U * (position & 0x03U)));
        temp |= ((uint32_t)(GPIO_GET_INDEX(GPIOx)) << (4U * (position & 0x03U)));
        SYSCFG->EINTCFG[position >> 2U] = temp;
#endif /* APM32F403xx || APM32F402xx */

        /* Clear Rising Falling edge configuration */
        temp = EINT->RTEN;
        temp &= ~((uint32_t)iocurrent);
        if((GPIO_Init->Mode & TRIGGER_RISING) != 0x00U)
        {
          temp |= iocurrent;
        }
        EINT->RTEN = temp;

        temp = EINT->FTEN;
        temp &= ~((uint32_t)iocurrent);
        if((GPIO_Init->Mode & TRIGGER_FALLING) != 0x00U)
        {
          temp |= iocurrent;
        }
        EINT->FTEN = temp;

        temp = EINT->EMASK;
        temp &= ~((uint32_t)iocurrent);
        if((GPIO_Init->Mode & EINT_EVT) != 0x00U)
        {
          temp |= iocurrent;
        }
        EINT->EMASK = temp;

        /* Clear EINT line configuration */
        temp = EINT->IMASK;
        temp &= ~((uint32_t)iocurrent);
        if((GPIO_Init->Mode & EINT_IT) != 0x00U)
        {
          temp |= iocurrent;
        }
        EINT->IMASK = temp;
      }
    }
  }
}

/**
  * @brief  De-initializes the GPIOx peripheral registers to their default reset values.
  * @param  GPIOx where x can be (A..I) to select the GPIO peripheral for APM32F40XX.
  * @param  GPIO_Pin specifies the port bit to be written.
  *          This parameter can be one of GPIO_PIN_x where x can be (0..15).
  * @retval None
  */
void DAL_GPIO_DeInit(GPIO_TypeDef  *GPIOx, uint32_t GPIO_Pin)
{
  uint32_t position;
  uint32_t ioposition = 0x00U;
  uint32_t iocurrent = 0x00U;
  uint32_t tmp = 0x00U;
#if defined(APM32F403xx) || defined(APM32F402xx)
  __IO uint32_t *configregister; /* Store the address of CRL or CRH register based on pin number */
  uint32_t registeroffset;
#endif /* APM32F403xx || APM32F402xx */

  /* Check the parameters */
  ASSERT_PARAM(IS_GPIO_ALL_INSTANCE(GPIOx));
  
  /* Configure the port pins */
  for(position = 0U; position < GPIO_NUMBER; position++)
  {
    /* Get the IO position */
    ioposition = 0x01U << position;
    /* Get the current IO position */
    iocurrent = (GPIO_Pin) & ioposition;

    if(iocurrent == ioposition)
    {
      /*------------------------- EINT Mode Configuration --------------------*/
#if defined(APM32F403xx) || defined(APM32F402xx)
      tmp = AFIO->EINTSEL[position >> 2U];
#else
      tmp = SYSCFG->EINTCFG[position >> 2U];
#endif /* APM32F403xx || APM32F402xx */
      tmp &= (0x0FU << (4U * (position & 0x03U)));
      if(tmp == ((uint32_t)(GPIO_GET_INDEX(GPIOx)) << (4U * (position & 0x03U))))
      {
        /* Clear EINT line configuration */
        EINT->IMASK &= ~((uint32_t)iocurrent);
        EINT->EMASK &= ~((uint32_t)iocurrent);
        
        /* Clear Rising Falling edge configuration */
        EINT->FTEN &= ~((uint32_t)iocurrent);
        EINT->RTEN &= ~((uint32_t)iocurrent);

        /* Configure the External Interrupt or event for the current IO */
        tmp = 0x0FU << (4U * (position & 0x03U));
#if defined(APM32F403xx) || defined(APM32F402xx)
        AFIO->EINTSEL[position >> 2U] &= ~tmp;
#else
        SYSCFG->EINTCFG[position >> 2U] &= ~tmp;
#endif /* APM32F403xx || APM32F402xx */
      }

      /*------------------------- GPIO Mode Configuration --------------------*/
#if defined(APM32F403xx) || defined(APM32F402xx)
      /* Check if the current bit belongs to first half or last half of the pin count number
       in order to address CFGHIG or CFGLOW register */
      configregister = (iocurrent < GPIO_PIN_8) ? &GPIOx->CFGLOW     : &GPIOx->CFGHIG;
      registeroffset = (iocurrent < GPIO_PIN_8) ? (position << 2u) : ((position - 8u) << 2u);

      /* CFGLOW/CFGHIG default value is floating input(0x04) shifted to correct position */
      MODIFY_REG(*configregister, ((GPIO_CFGLOW_MODE0 | GPIO_CFGLOW_CFG0) << registeroffset), GPIO_CFGLOW_CFG0_0 << registeroffset);

      /* ODATA default value is 0 */
      CLEAR_BIT(GPIOx->ODATA, iocurrent);
#else
      /* Configure IO Direction in Input Floating Mode */
      GPIOx->MODE &= ~(GPIO_MODE_MODE0 << (position * 2U));

      /* Configure the default Alternate Function in current IO */
      GPIOx->ALF[position >> 3U] &= ~(0xFU << ((uint32_t)(position & 0x07U) * 4U)) ;

      /* Deactivate the Pull-up and Pull-down resistor for the current IO */
      GPIOx->PUPD &= ~(GPIO_PUPD_PUPDR0 << (position * 2U));

      /* Configure the default value IO Output Type */
      GPIOx->OMODE  &= ~(GPIO_OMODE_OT_0 << position) ;

      /* Configure the default value for IO Speed */
      GPIOx->OSSEL &= ~(GPIO_OSPEEDER_OSPEEDR0 << (position * 2U));
#endif /* APM32F403xx || APM32F402xx */
    }
  }
}

/**
  * @}
  */

/** @defgroup GPIO_Exported_Functions_Group2 IO operation functions 
  *  @brief   GPIO Read and Write
  *
@verbatim
 ===============================================================================
                       ##### IO operation functions #####
 ===============================================================================

@endverbatim
  * @{
  */

/**
  * @brief  Reads the specified input port pin.
  * @param  GPIOx where x can be (A..I) to select the GPIO peripheral for APM32F40XX.
  * @param  GPIO_Pin specifies the port bit to read.
  *         This parameter can be GPIO_PIN_x where x can be (0..15).
  * @retval The input port pin value.
  */
GPIO_PinState DAL_GPIO_ReadPin(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin)
{
  GPIO_PinState bitstatus;

  /* Check the parameters */
  ASSERT_PARAM(IS_GPIO_PIN(GPIO_Pin));

