betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_gpio.c
  if((GPIOx->IDATA & GPIO_Pin) != (uint32_t)GPIO_PIN_RESET)
  {
    bitstatus = GPIO_PIN_SET;
  }
  else
  {
    bitstatus = GPIO_PIN_RESET;
  }
  return bitstatus;
}

/**
  * @brief  Sets or clears the selected data port bit.
  *
  * @note   This function uses GPIOx_BSRR register to allow atomic read/modify
  *         accesses. In this way, there is no risk of an IRQ occurring between
  *         the read and the modify access.
  *
  * @param  GPIOx where x can be (A..I) to select the GPIO peripheral for APM32F40XX.
  * @param  GPIO_Pin specifies the port bit to be written.
  *          This parameter can be one of GPIO_PIN_x where x can be (0..15).
  * @param  PinState specifies the value to be written to the selected bit.
  *          This parameter can be one of the GPIO_PinState enum values:
  *            @arg GPIO_PIN_RESET: to clear the port pin
  *            @arg GPIO_PIN_SET: to set the port pin
  * @retval None
  */
void DAL_GPIO_WritePin(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, GPIO_PinState PinState)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_GPIO_PIN(GPIO_Pin));
  ASSERT_PARAM(IS_GPIO_PIN_ACTION(PinState));

  if(PinState != GPIO_PIN_RESET)
  {
    GPIOx->BSC = GPIO_Pin;
  }
  else
  {
    GPIOx->BSC = (uint32_t)GPIO_Pin << 16U;
  }
}

/**
  * @brief  Toggles the specified GPIO pins.
  * @param  GPIOx Where x can be (A..I) to select the GPIO peripheral for APM32F40XX.
  * @param  GPIO_Pin Specifies the pins to be toggled.
  * @retval None
  */
void DAL_GPIO_TogglePin(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin)
{
  uint32_t odr;

  /* Check the parameters */
  ASSERT_PARAM(IS_GPIO_PIN(GPIO_Pin));

  /* get current Output Data Register value */
  odr = GPIOx->ODATA;

  /* Set selected pins that were at low level, and reset ones that were high */
  GPIOx->BSC = ((odr & GPIO_Pin) << GPIO_NUMBER) | (~odr & GPIO_Pin);
}

/**
  * @brief  Locks GPIO Pins configuration registers.
  * @note   The locked registers are GPIOx_MODE, GPIOx_OMODE, GPIOx_OSSEL,
  *         GPIOx_PUPD, GPIOx_ALFL and GPIOx_ALFH.
  * @note   The configuration of the locked GPIO pins can no longer be modified
  *         until the next reset.
  * @param  GPIOx where x can be (A..F) to select the GPIO peripheral for APM32F4 family
  * @param  GPIO_Pin specifies the port bit to be locked.
  *         This parameter can be any combination of GPIO_PIN_x where x can be (0..15).
  * @retval None
  */
DAL_StatusTypeDef DAL_GPIO_LockPin(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin)
{
  __IO uint32_t tmp = GPIO_LOCK_LOCKKEY;

  /* Check the parameters */
  ASSERT_PARAM(IS_GPIO_PIN(GPIO_Pin));

  /* Apply lock key write sequence */
  tmp |= GPIO_Pin;
  /* Set LCKx bit(s): LCKK='1' + LCK[15-0] */
  GPIOx->LOCK = tmp;
  /* Reset LCKx bit(s): LCKK='0' + LCK[15-0] */
  GPIOx->LOCK = GPIO_Pin;
  /* Set LCKx bit(s): LCKK='1' + LCK[15-0] */
  GPIOx->LOCK = tmp;
  /* Read LCKR register. This read is mandatory to complete key lock sequence */
  tmp = GPIOx->LOCK;

  /* Read again in order to confirm lock is active */
 if((GPIOx->LOCK & GPIO_LOCK_LOCKKEY) != RESET)
  {
    return DAL_OK;
  }
  else
  {
    return DAL_ERROR;
  }
}

/**
  * @brief  This function handles EINT interrupt request.
  * @param  GPIO_Pin Specifies the pins connected EINT line
  * @retval None
  */
void DAL_GPIO_EINT_IRQHandler(uint16_t GPIO_Pin)
{
  /* EINT line interrupt detected */
  if(__DAL_GPIO_EINT_GET_IT(GPIO_Pin) != RESET)
  {
    __DAL_GPIO_EINT_CLEAR_IT(GPIO_Pin);
    DAL_GPIO_EINT_Callback(GPIO_Pin);
  }
}

/**
  * @brief  EINT line detection callbacks.
  * @param  GPIO_Pin Specifies the pins connected EINT line
  * @retval None
  */
__weak void DAL_GPIO_EINT_Callback(uint16_t GPIO_Pin)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(GPIO_Pin);
  /* NOTE: This function Should not be modified, when the callback is needed,
           the DAL_GPIO_EINT_Callback could be implemented in the user file
   */
}

/**
  * @}
  */


/**
  * @}
  */

#endif /* DAL_GPIO_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

